InformationRegisters/инт_НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>инт_НастройкиСистемы</Name>
			<Comment>//s.i.d</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрокаНеограниченная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РазделНастроек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_РазделНастроек</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/инт_НастройкиСистемы/Ext/ManagerModule.bsl
// 2023-10-05, Small & Skif, ДИТ, Сагнаев Данияр
// Разработано в рамках задачи https://trello.com/c/s72pYKqJ
// Записывает настройку как запись регистра
// Параметры - СтруктураНастройки - тип структура - имена ключей должны совпадать со именами полей регистра
//             значения должны соответствовать по типу полям регистра
//             Обязательные ключи - имена измерений регистра
// Возвращаемое значение истина если запись удалась, ложь - если запись не удалась
//
Функция ЗаписатьНастройкуСистемы(СтруктураНастройки) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Запись = РегистрыСведений.инт_НастройкиСистемы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, СтруктураНастройки);                   
		Запись.Записать();
		ОбновитьПовторноИспользуемыеЗначения();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка записи настройки системы (SS)", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// 2023-10-05, Small & Skif, ДИТ, Сагнаев Данияр
// Разработано в рамках задачи https://trello.com/c/s72pYKqJ
// Получает значения настройки из запись регистра
// Параметры 
//  ПараметрыПолучения - Структура - Управляет поведением функции, смотрите код.
//     Обязательные ключи:
//		РазделНастроек - Строка, СправочникСсылка.SMALL_РазделНастроек - Передается имя элемента справочника или ссылка
//		ПолучитьЗначение - Булево - Истина, возвращает данные "Значение"
//		ПолучитьЗначениеХранилище - Булево - Истина, возвращает данные "ЗначениеСтрокаНеограниченная"
//		ПолучитьЗначениеСтрокаНеограниченная - Булево - Истина, возвращает данные "ПолучитьЗначениеСтрокаНеограниченная"
// Возвращаемое значение 
//	- Структура - Если нужно получить более одного значения
//  - Значение - Требуется получить только одно из значений
//  - NULL - Ошибка получения настроек
//
Функция ПолучитьНастройкуСистемы(ПараметрыПолучения) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыПолучения.Свойство("РазделНастроек") = Ложь Тогда
		Возврат NULL; // Тот кто вызвал сам не знает что он хочет.
	КонецЕсли;
	
	РазделНастроекСсылка = Неопределено;
	Если ТипЗнч(ПараметрыПолучения.РазделНастроек) = Тип("Строка") Тогда
		РазделНастроекСсылка = ПолучитьРазделНастроекПоИмени(ПараметрыПолучения.РазделНастроек);
	Иначе
		РазделНастроекСсылка = ПараметрыПолучения.РазделНастроек; 
	КонецЕсли;
	
	Если не ТипЗнч(РазделНастроекСсылка) = Тип("СправочникСсылка.инт_РазделНастроек") Тогда
		Возврат NULL;
	КонецЕсли;
	
	ПолучитьЗнч1  = ПараметрыПолучения.Свойство("ПолучитьЗначение") и ПараметрыПолучения.ПолучитьЗначение = Истина;
	ПолучитьЗнч2  = ПараметрыПолучения.Свойство("ПолучитьЗначениеХранилище") и ПараметрыПолучения.ПолучитьЗначениеХранилище = Истина;
	ПолучитьЗнч3  = ПараметрыПолучения.Свойство("ПолучитьЗначениеСтрокаНеограниченная") и ПараметрыПолучения.ПолучитьЗначениеСтрокаНеограниченная = Истина;
    ЗапятаяПоля1  = ?(ПолучитьЗнч1 и (ПолучитьЗнч2 или ПолучитьЗнч3), ",", "");
	ЗапятаяПоля2  = ?(ПолучитьЗнч2 и ПолучитьЗнч3 , ",", "");
	ПолеЗапроса1  = ?(ПолучитьЗнч1, "РС.Значение КАК Знч1", "");
	ПолеЗапроса2  = ?(ПолучитьЗнч2, "РС.ЗначениеХранилище КАК Знч2", "");
	ПолеЗапроса3  = ?(ПолучитьЗнч3, "РС.ЗначениеСтрокаНеограниченная КАК Знч3", "");
	
	КонтрольнаяСумма = ПолучитьЗнч1 + ПолучитьЗнч2 + ПолучитьЗнч3;
    Если КонтрольнаяСумма = 0 Тогда
		Возврат NULL; // Тот кто вызвал сам не знает что он хочет.
	КонецЕсли;
	
	Если КонтрольнаяСумма = 1 Тогда
		РезультатСтруктура  = Новый Структура;
	Иначе
		РезультатСтруктура = Новый Структура(?(ПолучитьЗнч1, "Значение", "") + ЗапятаяПоля1 + 
		                           ?(ПолучитьЗнч2, "ЗначениеХранилище", "")  + ЗапятаяПоля2 + 
								   ?(ПолучитьЗнч3, "ЗначениеСтрокаНеограниченная", ""));
	КонецЕсли;
	   	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ " + ПолеЗапроса1 + ЗапятаяПоля1 + ПолеЗапроса2 + ЗапятаяПоля2 + ПолеЗапроса3 + "
	|ИЗ
	|	РегистрСведений.инт_НастройкиСистемы КАК РС
	|ГДЕ
	|	РС.РазделНастроек = &РазделНастроек";
	Запрос.УстановитьПараметр("РазделНастроек", РазделНастроекСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат NULL;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если ПолучитьЗнч1 Тогда		
		Если КонтрольнаяСумма = 1 Тогда
			Возврат Выборка.Знч1;
		КонецЕсли;		
		РезультатСтруктура.Значение = Выборка.Знч1;		
	КонецЕсли;                            
	
	Если ПолучитьЗнч2 Тогда
		
		Если ТипЗнч(Выборка.Знч2) = Тип("ХранилищеЗначения")  Тогда
			Знч = Выборка.Знч2.Получить();
		Иначе
			Знч = Выборка.Знч2;
		КонецЕсли;
		
		Если КонтрольнаяСумма = 1 Тогда
			Возврат Знч;
		КонецЕсли;
		
		РезультатСтруктура.ЗначениеХранилище = Знч;
		
	КонецЕсли;
	
	Если ПолучитьЗнч3 Тогда
		
		Знч = Выборка.Знч3;
		ПреобразоватьИзСтрокиВнутрЗнч3 = ПараметрыПолучения.Свойство("ПреобразоватьИзСтрокиВнутрСтрокаНеограниченная") и ПараметрыПолучения.ПреобразоватьИзСтрокиВнутрСтрокаНеограниченная = Истина;
		Если ПреобразоватьИзСтрокиВнутрЗнч3 Тогда			
			Попытка 
				Знч = ЗначениеИзСтрокиВнутр(Знч);
			Исключение
				// В случае не удачи вернется то что получена из запроса пусть с этим разбираются там откуда вызвали
			КонецПопытки;			
		КонецЕсли;		
		
		Если КонтрольнаяСумма = 1 Тогда
			Возврат Знч;
		КонецЕсли; 
		
		РезультатСтруктура.ЗначениеСтрокаНеограниченная = Знч;
		
	КонецЕсли;
	
	Возврат РезультатСтруктура;
	
КонецФункции

// 2023-10-05, Small & Skif, ДИТ, Сагнаев Данияр
//
// Разработано в рамках задачи https://trello.com/c/s72pYKqJ
//
// Получает ссылку на элемент справочника SMALL_РазделНастроек
//
// Параметры - Имя          - тип строка - поле поиска по реквизиту справочника "Имя";
//             Наименование - тип строка - наименование элемента справочника, имеет смысл передавать если третий параметра Истина
//             СоздатьНовый - тип булево - признак того что нужно создать новый элемент справочника, если он не найден по первому параметру
//
// Возвращаемое ссылка справочника SMALL_РазделНастроек
//
Функция ПолучитьРазделНастроекПоИмени(Имя, Наименование = "", СоздатьНовый = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если не ЗначениеЗаполнено(Имя) Тогда
		Возврат Справочники.инт_РазделНастроек.ПустаяСсылка();
	КонецЕсли;
	
	Если не ТипЗнч(Имя) = Тип("Строка") Тогда
		Возврат Справочники.инт_РазделНастроек.ПустаяСсылка();
	КонецЕсли;
	
	РазделНастроекСсылка = Справочники.инт_РазделНастроек.НайтиПоНаименованию(Имя, Истина);
	Если ЗначениеЗаполнено(РазделНастроекСсылка) или не СоздатьНовый = Истина Тогда
		Возврат РазделНастроекСсылка;
	КонецЕсли;
	
	СпрОбъект = Справочники.инт_РазделНастроек.СоздатьЭлемент();
	СпрОбъект.Наименование = Имя;
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции
